Revit 2024 API
WorksetTable.GetActiveWorksetId Method
 Returns the active workset's WorksetId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public WorksetId GetActiveWorksetId()
Visual Basic
Public Function GetActiveWorksetId As WorksetId
Visual C++
public:
WorksetId^ GetActiveWorksetId()
Return Value
 WorksetId of the active workset.
Examples
CopyC#
public Workset GetActiveWorkset(Document doc)
{
    // Get the workset table from the document
    WorksetTable worksetTable = doc.GetWorksetTable();
    // Get the Id of the active workset
    WorksetId activeId = worksetTable.GetActiveWorksetId();
    // Find the workset with that Id
    Workset workset = worksetTable.GetWorkset(activeId);
    return workset;
}
CopyVB.NET
Public Function GetActiveWorkset(doc As Document) As Workset
    ' Get the workset table from the document
    Dim worksetTable As WorksetTable = doc.GetWorksetTable()
    ' Get the Id of the active workset
    Dim activeId As WorksetId = worksetTable.GetActiveWorksetId()
    ' Find the workset with that Id
    Dim workset As Workset = worksetTable.GetWorkset(activeId)
    Return workset
End Function
See Also
WorksetTable Class
Autodesk.Revit.DB Namespace